# -*- coding: utf-8 -*-
"""
Created on Thu Aug 11 18:17:53 2022

@author: anani
"""
import re

abbreveations={
  "ት/ቤት": "ትምህርት ቤት",
  "ት/ርት": "ትምህርት",
  "ት/ክፍል": "ትምህርት ክፍል",
  "ሃ/አለቃ": "ሃምሳ አለቃ",
  "ሃ/ስላሴ": "ሃይለ ስላሴ",
  "ደ/ዘይት": "ደብረ ዘይት",
  "ደ/ታቦር": "ደብረ ታቦር",
  "መ/ር": "መምህር",
  "መ/ቤት": "መስሪያ ቤት",
  "መ/አለቃ": "መቶ አለቃ",
  "ክ/ከተማ": "ክፍለ ከተማ",
  "ክ/ሀገር": "ክፍለ ሀገር",
  "ወ/ር": "",
  "ወ/ሮ": "ወይዘሮ",
  "ወ/ሪት": "ወይዘሪት",
  "ወ/ስላሴ": "ወልደ ስላሴ",
  "ፍ/ስላሴ": "ፍቅረ ስላሴ",
  "ፍ/ቤት": "ፍርድ ቤት",
  "ጽ/ቤት": "ጽህፈት ቤት",
  "ሲ/ር": "",
  "ፕ/ር": "ፕሮፌሰር",
  "ጠ/ሚንስትር": "ጠቅላይ ሚኒስተር",
  "ዶ/ር": "ዶክተር",
  "ገ/ገዮርጊስ": "",
  "ቤ/ክርስትያን": "ቤተ ክርስትያን",
  "ም/ስራ": "",
  "ም/ቤት": "ምክር ቤተ",
  "ተ/ሃይማኖት": "ተክለ ሃይማኖት",
  "ሚ/ር": "ሚኒስትር",
  "ኮ/ል": "ኮሎኔል",
  "ሜ/ጀነራል": "ሜጀር ጀነራል",
  "ብ/ጀነራል": "ብርጋደር ጀነራል",
  "ሌ/ኮለኔል": "ሌተናንት ኮለኔል",
  "ሊ/መንበር": "ሊቀ መንበር",
  "አ/አ": "ኣዲስ ኣበባ",
  "ር/መምህር": "ርዕሰ መምህር",
  "ፕ/ት": "",
  "ዓም": "ዓመተ ምህረት",
  "ዓ.ዓ": "ዓመተ ዓለም",
}

def lex_analyzer(corpus):
    corpus_word=corpus.split(" ")
    for word in corpus_word:
        if(abbreveations.get("{}".format(word))!=None):
            corpus=re.sub(word,abbreveations["{}".format(word)],corpus)
    corpus=re.sub("[\?'-_,~()\‘,\"።#!$%^፡&”፣“*‘’፥;:፤።0123456789፩፪፫፬፭፮፮፰፱፲፳፴፵፵፷፸፹፺፻qwertyuiopasdfghjklzxcvbnm]"," ",corpus)
    corpus=re.sub("[a-z]"," ",corpus)
    return corpus

